
#### Terraform Format and Style 🖌: success
#### Terraform Initialization ⚙️: success
#### Terraform Validation 🤖: Success! The configuration is valid.


#### Terraform Plan 📖: success
<details><summary>Show Plan</summary>

```
terraform
module.ec2.tls_private_key.main: Refreshing state... [id=5a7970533ed394acda9ee9b4635965c0bafa34f6]
module.git.github_repository.devops_challenge: Refreshing state... [id=devops-challenge-teamsoft]
module.git.github_branch_protection.devops_challenge: Refreshing state... [id=BPR_kwDONzXdBs4DiCuz]
module.git.github_actions_secret.devops_challenge_runner_github_token: Refreshing state... [id=devops-challenge-teamsoft:RUNNER_GITHUB_TOKEN]
module.git.github_actions_secret.devops_challenge_thandi_cidr_ipv4: Refreshing state... [id=devops-challenge-teamsoft:THANDI_CIDR_IPV4]
module.git.github_actions_secret.devops_challenge_aws_access_key_id: Refreshing state... [id=devops-challenge-teamsoft:AWS_ACCESS_KEY_ID]
module.git.github_actions_secret.devops_challenge_git_auth_token: Refreshing state... [id=devops-challenge-teamsoft:GIT_AUTH_TOKEN]
module.git.github_actions_secret.devops_challenge_aws_secret_access_key: Refreshing state... [id=devops-challenge-teamsoft:AWS_SECRET_ACCESS_KEY]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-01a2a4df085287311]
module.s3.aws_s3_bucket.server_terraform_bucket: Refreshing state... [id=devops-challenge-teamsoft-terraform-bucket]
module.s3.aws_s3_bucket.server_ssh_keys_bucket: Refreshing state... [id=devops-challenge-teamsoft-ssh-keys-bucket]
module.ec2.aws_key_pair.main: Refreshing state... [id=server-key]
module.s3.aws_s3_bucket_versioning.server_terraform_bucket: Refreshing state... [id=devops-challenge-teamsoft-terraform-bucket]
module.ec2.aws_s3_object.ssh_private_key: Refreshing state... [id=ssh-keys/server-key.pem]
module.vpc.aws_route_table.main_public: Refreshing state... [id=rtb-0996922b3d691f532]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-0c2cb008c88e6cb17]
module.vpc.aws_security_group.main: Refreshing state... [id=sg-02a0a6a3f1dd78a9b]
module.vpc.aws_subnet.main_public: Refreshing state... [id=subnet-07545b1673838832f]
module.vpc.aws_route.main_public_internet_access: Refreshing state... [id=r-rtb-0996922b3d691f5321080289494]
module.vpc.aws_vpc_security_group_ingress_rule.main_http_ingress_rule: Refreshing state... [id=sgr-0fca44cfd92afec79]
module.vpc.aws_vpc_security_group_ingress_rule.main_thandi_node_exporter_ingress_rule: Refreshing state... [id=sgr-0ed166f2e5fc12fbd]
module.vpc.aws_vpc_security_group_egress_rule.main_allow_all_traffic_egress_rule: Refreshing state... [id=sgr-04b94722415e79eb5]
module.vpc.aws_vpc_security_group_ingress_rule.main_thandi_ssh_ingress_rule: Refreshing state... [id=sgr-0b5493b8602b32ce3]
module.vpc.aws_vpc_security_group_ingress_rule.main_thandi_prometheus_ingress_rule: Refreshing state... [id=sgr-05aaed88b884555e5]
module.vpc.aws_route_table_association.main_public: Refreshing state... [id=rtbassoc-0c7042658650cd935]
module.ec2.aws_instance.server: Refreshing state... [id=i-0ceda51e5925fe7e5]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.ec2.aws_s3_object.ssh_private_key has changed
  ~ resource "aws_s3_object" "ssh_private_key" {
        id                            = "ssh-keys/server-key.pem"
      + metadata                      = {}
      + tags                          = {}
        # (25 unchanged attributes hidden)
    }

  # module.git.github_repository.devops_challenge has changed
  ~ resource "github_repository" "devops_challenge" {
      ~ etag                        = "W/\"142f4829173cfb7937da3dfbaa33544ea46a0ac675073e9d09f46b0602fd2a53\"" -> "W/\"36ba6de2e2449cb9a86a43b41e79ce57b089ef6eaec0847fe4e6ebc51c030ae6\""
        id                          = "devops-challenge-teamsoft"
        name                        = "devops-challenge-teamsoft"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route_table.main_public has changed
  ~ resource "aws_route_table" "main_public" {
        id               = "rtb-0996922b3d691f532"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0c2cb008c88e6cb17"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Managedby" = "Terraform"
            "Name"      = "main-public-route-table"
            "Owner"     = "Thandi"
            "Project"   = "Server"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_security_group.main has changed
  ~ resource "aws_security_group" "main" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-02a0a6a3f1dd78a9b"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "201.17.159.240/32",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "201.17.159.240/32",
                ]
              + description      = ""
              + from_port        = 9090
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9090
            },
          + {
              + cidr_blocks      = [
                  + "201.17.159.240/32",
                ]
              + description      = ""
              + from_port        = 9100
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9100
            },
        ]
        name                   = "main-security-group"
        tags                   = {
            "Managedby" = "Terraform"
            "Name"      = "main-security-group"
            "Owner"     = "Thandi"
            "Project"   = "Server"
        }
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ec2.aws_instance.server must be replaced
-/+ resource "aws_instance" "server" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:183295410426:instance/i-0ceda51e5925fe7e5" -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0ceda51e5925fe7e5" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0e83eab955651f5a2" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-7.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.7" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "18.208.163.131" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Managedby" = "Terraform"
            "Name"      = "server"
            "Owner"     = "Thandi"
            "Project"   = "Server"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (11 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 2 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device { # forces replacement
          + delete_on_termination = true
          + device_name           = "server"
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = {
              + "Managedby" = "Terraform"
              + "Name"      = "server"
              + "Owner"     = "Thandi"
              + "Project"   = "Server"
            }
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ tags_all              = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-078102cc0513bb5dc" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ public_instance_ip = "18.208.163.131" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pusher: @thandioque, Action: pull_request, Working Directory: terraform, Workflow: Terraform Plan*